# Pandas basics
- site used : [link](https://doorbw.tistory.com/172)

# 1. Pandas란
### Pandas는 파이썬에서 사용하는 데이터 분석 라이브러리.
### 행과 열로 이루어진 데이터 객체를 만들 수 있어 편리

## 1) Import 설정

In [1]:
# Pandas 사용하기
import numpy as np
import pandas as pd

## 2) 데이터 타입
## Series 와 dataframe 두가지 대표가 있음

### 2-1) Series

In [2]:
# Series 정의하기
# list로 지정하고, index는 0부터 순차적으로 향상하여 부여 
# 아마 1차원 데이터인 듯
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
# Series index 정보만 확인하기
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
# Series 자료형 확인하기
obj.dtypes

dtype('int64')

In [5]:
# 인덱스 바꾸기
obj2 = pd.Series([4, 7, -5, 3], index=['d','a','b','c'])
obj2

d    4
a    7
b   -5
c    3
dtype: int64

In [6]:
# 이런식으로는 index 수정은 불가능하고
# 선언시에 index 지정해줘서 series의 인덱스를 정해주는 식으로 구현
obj3 = pd.Series(obj, index=['4', '5', '6', '7'])
obj3

4   NaN
5   NaN
6   NaN
7   NaN
dtype: float64

In [7]:
# python dictionary에서 바로 series 로 만들 수 있음
# dictionary의 key 가 series의 index가 된다
sdata = {'Kim': 35000, 'Beomwoo': 67000, 'Joan': 12000, 'Choi': 4000}
obj3_sdata = pd.Series(sdata)
obj3_sdata

Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
dtype: int64

In [8]:
obj3_sdata.name = 'Salary'
obj3_sdata

Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
Name: Salary, dtype: int64

In [9]:
obj3_sdata.index

Index(['Kim', 'Beomwoo', 'Joan', 'Choi'], dtype='object')

In [10]:
print(obj3_sdata.index.name)

None

In [11]:
# index도 객체처럼 취급될 수 있음 / 안에 property로 되어있어서
obj3_sdata.index.name = 'Names'
obj3_sdata

Names
Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
Name: Salary, dtype: int64

In [12]:
# index property in pd.Series 변경
obj3_sdata.index = ['A', 'B', 'C', 'D']
obj3_sdata

A    35000
B    67000
C    12000
D     4000
Name: Salary, dtype: int64

### 2-2) Dataframe

In [13]:
# Data Frame 정의하기
# 이전에 DataFrame에 들어갈 데이터를 정의해주어야 하는데,
# 이는 python의 dictionary 또는 numpy의 array로 정의할 수 있다.

# Series 여러개가 붙은게 Dataframe처럼 생각 되는데 맞는지는 모르겠다.
# Series key는 index값이 되었는데
# df에서는 key 값으로 됨
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [14]:
# dataframe index
df.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
# dataframe columns
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [16]:
# df 값만 얻기, numpy 형태로 돌려주는 듯
df.values

array([['Beomwoo', 2013, 1.5],
       ['Beomwoo', 2014, 1.7],
       ['Beomwoo', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2015, 2.9]], dtype=object)

In [17]:
# index와 column에 대한 이름 설정
df.index.name = 'Num'
df.columns.name = 'Info'
df

Info     name  year  points
Num
0     Beomwoo  2013     1.5
1     Beomwoo  2014     1.7
2     Beomwoo  2015     3.6
3         Kim  2016     2.4
4        Park  2015     2.9

In [18]:
# df dictionary로 선언하면서
# 동시에 name 설정
# key값이 없어서 data에 없는 column일 경우 NaN으로 대체
df2 = pd.DataFrame(data, 
                   columns=['year', 'name', 'points', 'penalty'], # dictionary에서 이미 key 설정, 여기서 순서 설정
                   index = ['one', 'two', 'three', 'four', 'five']
                  )
df2

       year     name  points penalty
one    2013  Beomwoo     1.5     NaN
two    2014  Beomwoo     1.7     NaN
three  2015  Beomwoo     3.6     NaN
four   2016      Kim     2.4     NaN
five   2015     Park     2.9     NaN

In [19]:
# describe를 통해 dataframe에 계산 가능한 값들에 대한 종류를 보여줌
df2.describe()

              year    points
count     5.000000  5.000000
mean   2014.600000  2.420000
std       1.140175  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2015.000000  2.900000
max    2016.000000  3.600000

# 3. DataFrame Indexing

In [20]:
data = {"names": ["Kilho", "Kilho", "Kilho", "Charles", "Charles"],
        "year": [2014, 2015, 2016, 2015, 2016],
        "points": [1.5, 1.7, 3.6, 2.4, 2.9]
       }
df = pd.DataFrame(data, 
        columns=["year", "names", "points", "penalty"],
        index=["one", "two", "three", "four", "five"])
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

### 3-1) DataFrame에서 열을 선택하고 조작

In [21]:
# column 하나 선택
df['year']

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [22]:
# 다른 방식의 column 선택
df.year

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [23]:
# 두가지의 col선택 , indexing 위해 2d list로 access
df[['year', 'points']]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [24]:
# 특정 열을 선택하고 값을 설정 (1)
print(df)
df['penalty'] = 0.5 # nan에서 일괄적으로 0.5로 변경
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

       year    names  points  penalty
one    2014    Kilho     1.5      0.5
two    2015    Kilho     1.7      0.5
three  2016    Kilho     3.6      0.5
four   2015  Charles     2.4      0.5
five   2016  Charles     2.9      0.5

In [25]:
# 개별적으로 변경
df['penalty'] = [0.1, 0.2, 0.3, 0.4, 0.5] # python list / numpy array
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.1
two    2015    Kilho     1.7      0.2
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [26]:
# 새로운 column추가, dictionary key값 추가하는거마냥 하면 됨
# dynamic 방식으로 access

In [27]:
# 새로운 열 ZERO 추가
print(df)
df['zero'] = np.arange(5)
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.1
two    2015    Kilho     1.7      0.2
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

       year    names  points  penalty  zero
one    2014    Kilho     1.5      0.1     0
two    2015    Kilho     1.7      0.2     1
three  2016    Kilho     3.6      0.3     2
four   2015  Charles     2.4      0.4     3
five   2016  Charles     2.9      0.5     4

In [28]:
# series를 새로 추가
# series로 넣을 때는 index 맞춰서 작업 가능
new_series = pd.Series([-1.2, -1.5, -1.7], 
                       index = ['one', 'two','four'])
print(df)
df['debt'] = new_series
df

       year    names  points  penalty  zero
one    2014    Kilho     1.5      0.1     0
two    2015    Kilho     1.7      0.2     1
three  2016    Kilho     3.6      0.3     2
four   2015  Charles     2.4      0.4     3
five   2016  Charles     2.9      0.5     4

       year    names  points  penalty  zero  debt
one    2014    Kilho     1.5      0.1     0  -1.2
two    2015    Kilho     1.7      0.2     1  -1.5
three  2016    Kilho     3.6      0.3     2   NaN
four   2015  Charles     2.4      0.4     3  -1.7
five   2016  Charles     2.9      0.5     4   NaN

### 3-2) 존재하는 열로 새로운 데이터의 열을 생성하고 추가

In [29]:
print(df)
df['net_points'] = df['points'] - df['penalty']
df

       year    names  points  penalty  zero  debt
one    2014    Kilho     1.5      0.1     0  -1.2
two    2015    Kilho     1.7      0.2     1  -1.5
three  2016    Kilho     3.6      0.3     2   NaN
four   2015  Charles     2.4      0.4     3  -1.7
five   2016  Charles     2.9      0.5     4   NaN

       year    names  points  penalty  zero  debt  net_points
one    2014    Kilho     1.5      0.1     0  -1.2         1.4
two    2015    Kilho     1.7      0.2     1  -1.5         1.5
three  2016    Kilho     3.6      0.3     2   NaN         3.3
four   2015  Charles     2.4      0.4     3  -1.7         2.0
five   2016  Charles     2.9      0.5     4   NaN         2.4

In [30]:
print(df)
df['high_points'] = df['net_points'] > 2.0
df

       year    names  points  penalty  zero  debt  net_points
one    2014    Kilho     1.5      0.1     0  -1.2         1.4
two    2015    Kilho     1.7      0.2     1  -1.5         1.5
three  2016    Kilho     3.6      0.3     2   NaN         3.3
four   2015  Charles     2.4      0.4     3  -1.7         2.0
five   2016  Charles     2.9      0.5     4   NaN         2.4

       year    names  points  penalty  zero  debt  net_points  high_points
one    2014    Kilho     1.5      0.1     0  -1.2         1.4        False
two    2015    Kilho     1.7      0.2     1  -1.5         1.5        False
three  2016    Kilho     3.6      0.3     2   NaN         3.3         True
four   2015  Charles     2.4      0.4     3  -1.7         2.0        False
five   2016  Charles     2.9      0.5     4   NaN         2.4         True

### 3-3) 존재하는 열 삭제

In [31]:
# column 삭제
print(df)
del df['high_points']
del df['net_points']
del df['zero']
df

       year    names  points  penalty  zero  debt  net_points  high_points
one    2014    Kilho     1.5      0.1     0  -1.2         1.4        False
two    2015    Kilho     1.7      0.2     1  -1.5         1.5        False
three  2016    Kilho     3.6      0.3     2   NaN         3.3         True
four   2015  Charles     2.4      0.4     3  -1.7         2.0        False
five   2016  Charles     2.9      0.5     4   NaN         2.4         True

       year    names  points  penalty  debt
one    2014    Kilho     1.5      0.1  -1.2
two    2015    Kilho     1.7      0.2  -1.5
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.7
five   2016  Charles     2.9      0.5   NaN

In [32]:
print(df)
df.index.name = 'Order'
df.columns.name = 'Info'
df

       year    names  points  penalty  debt
one    2014    Kilho     1.5      0.1  -1.2
two    2015    Kilho     1.7      0.2  -1.5
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.7
five   2016  Charles     2.9      0.5   NaN

Info   year    names  points  penalty  debt
Order
one    2014    Kilho     1.5      0.1  -1.2
two    2015    Kilho     1.7      0.2  -1.5
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.7
five   2016  Charles     2.9      0.5   NaN

### 3-4) DataFrame에서 행을 선택하고 조작하기

#### 선택하는 방법은 무수히 많음
- iloc : integer loctaion -> column 을 integer로 선택
- loc : location -> column을 label로 선택
-- loc / iloc 은 row는 선택사항, column은 필수인듯?

- 둘다 row는 integer / label로 받을 수 있음
- row -> col 순으로 작성

In [36]:
# integer로 row 선택
df[0:3]

Info   year  names  points  penalty  debt
Order
one    2014  Kilho     1.5      0.1  -1.2
two    2015  Kilho     1.7      0.2  -1.5
three  2016  Kilho     3.6      0.3   NaN

In [51]:
# label로 row 선택
df['one':'three']

Info     year  names  points  penalty  debt
Order
one    2014.0  Kilho     1.5      0.1  -1.2
two    2015.0  Kilho     1.7      0.2  -1.5
three  2016.0  Kilho     3.6      0.3   NaN

In [59]:
# 단 하나의 row 선택
# 더 좋은 방법은 iloc / loc으로 하면 됨, 하나의 row를 선택할 수 있음
df['one':'one']

Info     year  names  points  penalty  debt
Order
one    2014.0  Kilho     1.5      0.1  -1.2

In [61]:
df.iloc[1]

Info
year        2015
names      Kilho
points       1.7
penalty      0.2
debt        -1.5
Name: two, dtype: object

In [62]:
df.loc['one']

Info
year        2014
names      Kilho
points       1.5
penalty      0.1
debt        -1.2
Name: one, dtype: object

In [57]:
# slice로 선택하지 않으면 column label로 선택해야하는게 기본
# 리턴 값은 Series
df['year']

Order
one      2014.0
two      2015.0
three    2016.0
four     2015.0
five     2016.0
six      2013.0
Name: year, dtype: float64

In [41]:
# col label의 list로 col 선택
df[['year','points']]

Info   year  points
Order
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [45]:
# label로 row / col 한꺼번에 선택하기
# 여기서 부터 loc 사용해야 함
# 예시 (1)
df.loc['two':'four',['year', 'points']]

Info   year  points
Order
two    2015     1.7
three  2016     3.6
four   2015     2.4

In [63]:
# 예시 (2)
df.loc['two':'four','year':'points']

Info     year    names  points
Order
two    2015.0    Kilho     1.7
three  2016.0    Kilho     3.6
four   2015.0  Charles     2.4

In [66]:
# 예시 (3)
df.iloc[1:3, 4:5]

Info   debt
Order
two    -1.5
three   NaN

In [78]:
# 예시 (4)
print(df)
df.iloc[[1,3], [2,4]]

Info     year    names  points  penalty  debt
Order
one    2014.0    Kilho     1.5      0.1  -1.2
two    2015.0    Kilho     1.7      0.2  -1.5
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.7
five   2016.0  Charles     2.9      0.5   NaN
six    2013.0     June     4.0      0.1   2.1

Info   points  debt
Order
two       1.7  -1.5
four      2.4  -1.7

In [50]:
# 새로운 행 삽입하기
df.loc['six', : ] = [2013, 'June', 4.0, 0.1, 2.1]
df

Info     year    names  points  penalty  debt
Order
one    2014.0    Kilho     1.5      0.1  -1.2
two    2015.0    Kilho     1.7      0.2  -1.5
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.7
five   2016.0  Charles     2.9      0.5   NaN
six    2013.0     June     4.0      0.1   2.1

# 4. DataFrame 에서의 boolean indexing

In [80]:
# 현재 작업 df
df

Info     year    names  points  penalty  debt
Order
one    2014.0    Kilho     1.5      0.1  -1.2
two    2015.0    Kilho     1.7      0.2  -1.5
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.7
five   2016.0  Charles     2.9      0.5   NaN
six    2013.0     June     4.0      0.1   2.1

### 4-1) Row 제한 by Col value

In [71]:
# year가 2014보다 큰 boolean data
tmp_res = df['year'] > 2014
tmp_res

Order
one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [72]:
tmp_res['two']

True

In [79]:
# year가 2014보다 큰 모든 행의 값
# .loc 의 첫 값을 row value이고 제한사항을 걸어
# 만족하는 row만 선택되는 상황 -> row 영역에 col 제약이 있어가 row가 제한됨
# col은 제한사항 없는 상황
tmp_res = df.loc[df.year > 2014, :]
tmp_res

Info     year    names  points  penalty  debt
Order
two    2015.0    Kilho     1.7      0.2  -1.5
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.7
five   2016.0  Charles     2.9      0.5   NaN

In [75]:
tmp_res.loc['two']

Info
year        2015
names      Kilho
points       1.7
penalty      0.2
debt        -1.5
Name: two, dtype: object

In [81]:
# numpy에서와 같이 논리연산을 응용할 수 있다.
# Series 값을 만들어서 접근
# 예시 (1)
df.loc[(df['points']>2)&(df['points']<3),:]

Info     year    names  points  penalty  debt
Order
four   2015.0  Charles     2.4      0.4  -1.7
five   2016.0  Charles     2.9      0.5   NaN

In [83]:
# 예시 (2)
df.loc[ (df['names'] == 'Kilho'), ['names','points']]

Info   names  points
Order
one    Kilho     1.5
two    Kilho     1.7
three  Kilho     3.6

In [84]:
# 예시 (3)
df.loc[(df['points']>2) | (df['points']<3), ['names','points']]

Info     names  points
Order
one      Kilho     1.5
two      Kilho     1.7
three    Kilho     3.6
four   Charles     2.4
five   Charles     2.9
six       June     4.0

# 5. Data

In [85]:
Df = pd.DataFrame(np.random.randn(6, 4))
Df

          0         1         2         3
0  0.666280 -0.424171  1.605895 -1.485496
1 -0.507039  0.697759  3.144580  1.238239
2  0.888523  0.236470 -1.348804 -0.143086
3 -0.154046  1.106594  0.333964 -1.993356
4 -1.389123 -0.511077 -0.388204 -0.352739
5 -1.281599 -1.072730 -1.448441 -1.242954

In [88]:
# pandas에서 제공하는 date range함수는 
# datetime 자료형으로 구성된, 날짜 시각등을 알 수 있는 자료형을 만드는 함수

Df.columns = ['A', 'B', 'C', 'D']
Df.index = pd.date_range('20160701', periods=6)
Df.index

DatetimeIndex(['2016-07-01', '2016-07-02', '2016-07-03', '2016-07-04',
               '2016-07-05', '2016-07-06'],
              dtype='datetime64[ns]', freq='D')

In [101]:
Df

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

### copy method
- 참조 : [link](https://mizykk.tistory.com/63)

In [104]:
#  2016-07-02  / C 바뀜, .copy() 안쓰면 mutable이라 원본 변경됨
Df_cpy_1 = Df.copy()
Df_cpy_1.iloc[1,2] = 7
print(Df)
print(Df_cpy_1)

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0
                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  7.000000  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

### 5-1) index value 를 조회하는 법

In [99]:
# index value를 가지고 조회하는 법
# df 의 index  조회할 시 XXX_index 의 object로 리턴됨
# 이걸 .to_series()메서드로 변환시켜서 사용
tmp_res = Df.loc[Df.index.to_series().loc['2016-07-03':'2016-07-05'], : ]
tmp_res

                   A         B         C         D    F
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN

### 5-2) Nan 값 처리

In [111]:
# np.nan은 NaN값을 의미한다.
Df['F'] = [1.0, np.nan, 3.5, 6.1, np.nan, 7.0]
Df

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

#### 원본 바뀌지 않고 inplace도 아니고, 그냥 db마냥 결과값이 리턴 됨
#### 원본 변경을 원할 시 inplace = True로 넣어주면됨
#### (1) row 값들 중 1개라도 Nan 있는 경우

In [112]:

print(Df.dropna(how='any'))
Df

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

#### (2) row 값들 중 전부 Nan 있는 경우

In [110]:

print(Df.dropna(how='all'))
Df

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

#### (3) nan 값 대체

In [113]:
print(Df.fillna(value=0.5))
Df

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  0.5
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  0.5
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

#### (4) nan 값 확인하여 Df boolean indexing

In [114]:
Df.isnull()

                A      B      C      D      F
2016-07-01  False  False  False  False  False
2016-07-02  False  False  False  False   True
2016-07-03  False  False  False  False  False
2016-07-04  False  False  False  False  False
2016-07-05  False  False  False  False   True
2016-07-06  False  False  False  False  False

#### (5) Nan 포함하는 행 추출
#### 반드시 row select 할 때 제한 하는 col은 & | 으로 논리연산을 할 때
#### 개별 colmun에 대한 제한 조건이어야 함

In [199]:
Df.loc[Df.isnull()['F'], :]

                   A         B         C         D   F
2016-07-02 -0.507039  0.697759  3.144580  1.238239 NaN
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739 NaN

In [1]:
#help(Df)
print(1)

1

### 5-3) 특정 행 drop하기

In [119]:
# pandas는 다음 to_datetime 사용 
# date_range 함수도 존재
pd.to_datetime('20160701')

Timestamp('2016-07-01 00:00:00')

In [120]:
# 특정 행 drop하기
print(Df.drop(pd.to_datetime('20160701')))
Df

                   A         B         C         D    F
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

In [135]:
# 2개 이상도 가능
Df.drop([pd.to_datetime('20160702'),pd.to_datetime('20160704')])

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

In [146]:
tmp_drops = Df.loc[
    (Df.index.to_series() > pd.to_datetime('2016-07-02')) \
   &(Df.index.to_series() < pd.to_datetime('2016-07-05'))]

print(tmp_drops)

print(Df)
Df.drop(
    tmp_drops.index
)

                   A         B         C         D    F
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

### 5-4) 특정 열 drop하기
- del 연산은 원본에서 없애버리는 듯

In [123]:
print(Df.drop('F', axis=1)) # axis 기본 0 : 의미는 row
Df

                   A         B         C         D
2016-07-01  0.666280 -0.424171  1.605895 -1.485496
2016-07-02 -0.507039  0.697759  3.144580  1.238239
2016-07-03  0.888523  0.236470 -1.348804 -0.143086
2016-07-04 -0.154046  1.106594  0.333964 -1.993356
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954

                   A         B         C         D    F
2016-07-01  0.666280 -0.424171  1.605895 -1.485496  1.0
2016-07-02 -0.507039  0.697759  3.144580  1.238239  NaN
2016-07-03  0.888523  0.236470 -1.348804 -0.143086  3.5
2016-07-04 -0.154046  1.106594  0.333964 -1.993356  6.1
2016-07-05 -1.389123 -0.511077 -0.388204 -0.352739  NaN
2016-07-06 -1.281599 -1.072730 -1.448441 -1.242954  7.0

In [124]:
# 2개 이상의 열도 가능
Df.drop(['B','D'], axis = 1)

                   A         C    F
2016-07-01  0.666280  1.605895  1.0
2016-07-02 -0.507039  3.144580  NaN
2016-07-03  0.888523 -1.348804  3.5
2016-07-04 -0.154046  0.333964  6.1
2016-07-05 -1.389123 -0.388204  NaN
2016-07-06 -1.281599 -1.448441  7.0

# 6. Data 분석용 함수 툴

In [125]:
data = [[1.4, np.nan],
           [7.1, -4.5],
        [np.nan, np.nan],
        [0.75, -1.3]]
DF = pd.DataFrame(data, columns=["one", "two"], index=["a", "b", "c", "d"])
DF

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

### 6-1) 행 방향 합, 한 열의 value들 모두 합

In [126]:
DF.sum(axis=0) # axis = 0 이므로 행

one    9.25
two   -5.80
dtype: float64

### 6-2) 열 방향 합, 한 행의 value들 모두 합

In [128]:
DF.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

### 6-3) 다른 방식의 sum

In [131]:
# 특정 행 또는 특정 열에서만 계산하기
DF['one'].sum() # 열 계산

9.25

In [180]:
DF.loc['b',:].sum() # 행 계산

2.5999999999999996

pandas에서 DataFrame에 적용되는 함수들

sum() 함수 이외에도 pandas에서 DataFrame에 적용되는 함수는 다음의 것들이 있다.

count 전체 성분의 (NaN이 아닌) 값의 갯수를 계산

min, max 전체 성분의 최솟, 최댓값을 계산

argmin, argmax 전체 성분의 최솟값, 최댓값이 위치한 (정수)인덱스를 반환

idxmin, idxmax 전체 인덱스 중 최솟값, 최댓값을 반환

quantile 전체 성분의 특정 사분위수에 해당하는 값을 반환 (0~1 사이)

sum 전체 성분의 합을 계산

mean 전체 성분의 평균을 계산

median 전체 성분의 중간값을 반환

mad 전체 성분의 평균값으로부터의 절대 편차(absolute deviation)의 평균을 계산

std, var 전체 성분의 표준편차, 분산을 계산

cumsum 맨 첫 번째 성분부터 각 성분까지의 누적합을 계산 (0에서부터 계속 더해짐)

cumprod 맨 첫번째 성분부터 각 성분까지의 누적곱을 계산 (1에서부터 계속 곱해짐)

### 6-3) 다른 메서드 적용해보기

In [177]:
# 사용중인 dataframe
DF

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

#### (a) count

In [181]:
# 1) DF count - Nan 없이 계산
DF.count()

one    3
two    2
dtype: int64

In [182]:
# 2) DF count - nan 계산 -> count는 무조건 Nan 포함 안하는 듯
DF.count(skipna=False)

TypeError: count() got an unexpected keyword argument 'skipna'

In [183]:
DF['one'].count()

3

#### (b) min

In [186]:
DF.min()

one    0.75
two   -4.50
dtype: float64

In [191]:
DF['one'].min()

0.75

In [195]:
DF.min(axis=1)

a    1.4
b   -4.5
c    NaN
d   -1.3
dtype: float64

#### (c) argmax

In [198]:
print(DF)
DF.idxmax()

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

one    b
two    d
dtype: object

# 7. 정렬 함수 및 기타 메서드

In [155]:
df2 = pd.DataFrame(np.random.randn(6, 4),
                   columns=["A", "B", "C", "D"],
                   index=pd.date_range("20160701", periods=6))
df2

                   A         B         C         D
2016-07-01 -0.992464 -1.393403 -0.529352  0.538147
2016-07-02  2.377521 -0.102366  0.734260 -0.125385
2016-07-03 -0.612797  0.754677 -2.653876 -1.893683
2016-07-04  1.936856 -0.785233 -0.973897 -0.419979
2016-07-05 -2.354342  0.732271  2.352417 -1.059573
2016-07-06  0.008768 -0.452755  0.423542 -1.794791

### 7-1) 행 / 열 전체 오름/내림차순 정렬

In [134]:
# 함수를 위한 데이터 준비
dates = df2.index
random_dates = np.random.permutation(dates)
df2 = df2.reindex(index=random_dates, columns=["D", "B", "C", "A"])
df2

                   D         B         C         A
2016-07-03  0.234009  0.699160  0.181858 -0.580296
2016-07-05 -1.144865 -1.436736  0.785315 -0.404013
2016-07-04 -1.428097 -0.147146  0.318375  1.565948
2016-07-01 -0.032492  0.595622  0.464468 -0.842952
2016-07-06 -0.474424  1.417530  0.792851 -0.349310
2016-07-02  0.933513  1.230733 -1.124805  0.626787

In [152]:
# 행 방향으로 정렬, 기본이 오름차순
df2.sort_index(axis=0)

                   D         B         C         A
2016-07-01 -0.032492  0.595622  0.464468 -0.842952
2016-07-02  0.933513  1.230733 -1.124805  0.626787
2016-07-03  0.234009  0.699160  0.181858 -0.580296
2016-07-04 -1.428097 -0.147146  0.318375  1.565948
2016-07-05 -1.144865 -1.436736  0.785315 -0.404013
2016-07-06 -0.474424  1.417530  0.792851 -0.349310

In [153]:
# 행 방향으로 정렬, 내림차순으로 변경
df2.sort_index(axis=0, ascending=False)

                   D         B         C         A
2016-07-06 -0.474424  1.417530  0.792851 -0.349310
2016-07-05 -1.144865 -1.436736  0.785315 -0.404013
2016-07-04 -1.428097 -0.147146  0.318375  1.565948
2016-07-03  0.234009  0.699160  0.181858 -0.580296
2016-07-02  0.933513  1.230733 -1.124805  0.626787
2016-07-01 -0.032492  0.595622  0.464468 -0.842952

In [151]:
# 열 방향으로 정렬, 기본이 오름차순
df2.sort_index(axis=1)

                   A         B         C         D
2016-07-03 -0.580296  0.699160  0.181858  0.234009
2016-07-05 -0.404013 -1.436736  0.785315 -1.144865
2016-07-04  1.565948 -0.147146  0.318375 -1.428097
2016-07-01 -0.842952  0.595622  0.464468 -0.032492
2016-07-06 -0.349310  1.417530  0.792851 -0.474424
2016-07-02  0.626787  1.230733 -1.124805  0.933513

In [154]:
# 열 방향으로 정렬, 내림차순으로 변경
df2.sort_index(axis=1, ascending=False)

                   D         C         B         A
2016-07-03  0.234009  0.181858  0.699160 -0.580296
2016-07-05 -1.144865  0.785315 -1.436736 -0.404013
2016-07-04 -1.428097  0.318375 -0.147146  1.565948
2016-07-01 -0.032492  0.464468  0.595622 -0.842952
2016-07-06 -0.474424  0.792851  1.417530 -0.349310
2016-07-02  0.933513 -1.124805  1.230733  0.626787

### 7-2) 부분 정렬

In [156]:
# D로 부분정렬, 기본 오름차순
df2.sort_values(by='D')

                   A         B         C         D
2016-07-03 -0.612797  0.754677 -2.653876 -1.893683
2016-07-06  0.008768 -0.452755  0.423542 -1.794791
2016-07-05 -2.354342  0.732271  2.352417 -1.059573
2016-07-04  1.936856 -0.785233 -0.973897 -0.419979
2016-07-02  2.377521 -0.102366  0.734260 -0.125385
2016-07-01 -0.992464 -1.393403 -0.529352  0.538147

In [157]:
# D로 부분정렬, 내림차순으로 변경
df2.sort_values(by='D', ascending=False)

                   A         B         C         D
2016-07-01 -0.992464 -1.393403 -0.529352  0.538147
2016-07-02  2.377521 -0.102366  0.734260 -0.125385
2016-07-04  1.936856 -0.785233 -0.973897 -0.419979
2016-07-05 -2.354342  0.732271  2.352417 -1.059573
2016-07-06  0.008768 -0.452755  0.423542 -1.794791
2016-07-03 -0.612797  0.754677 -2.653876 -1.893683

In [158]:
# 두 column 을 동시에 고려하여 정렬
# 데이터 추가
df2["E"] = np.random.randint(0, 6, size=6)
df2["F"] = ["alpha", "beta", "gamma", "gamma", "alpha", "gamma"]
df2

                   A         B         C         D  E      F
2016-07-01 -0.992464 -1.393403 -0.529352  0.538147  0  alpha
2016-07-02  2.377521 -0.102366  0.734260 -0.125385  0   beta
2016-07-03 -0.612797  0.754677 -2.653876 -1.893683  4  gamma
2016-07-04  1.936856 -0.785233 -0.973897 -0.419979  2  gamma
2016-07-05 -2.354342  0.732271  2.352417 -1.059573  5  alpha
2016-07-06  0.008768 -0.452755  0.423542 -1.794791  2  gamma

In [159]:
# E열과 F열을 동시에 고려하여, 오름차순으로 하려면?
df2.sort_values(by=['E','F'])

                   A         B         C         D  E      F
2016-07-01 -0.992464 -1.393403 -0.529352  0.538147  0  alpha
2016-07-02  2.377521 -0.102366  0.734260 -0.125385  0   beta
2016-07-04  1.936856 -0.785233 -0.973897 -0.419979  2  gamma
2016-07-06  0.008768 -0.452755  0.423542 -1.794791  2  gamma
2016-07-03 -0.612797  0.754677 -2.653876 -1.893683  4  gamma
2016-07-05 -2.354342  0.732271  2.352417 -1.059573  5  alpha

### 7-3) 유니크한 row 값만 얻기

In [161]:
df2['F'].unique() # unique 값만 얻는 것

array(['alpha', 'beta', 'gamma'], dtype=object)

In [163]:
df2.loc[df2['F'].isin(df2['F'].unique()),:]

                   A         B         C         D  E      F
2016-07-01 -0.992464 -1.393403 -0.529352  0.538147  0  alpha
2016-07-02  2.377521 -0.102366  0.734260 -0.125385  0   beta
2016-07-03 -0.612797  0.754677 -2.653876 -1.893683  4  gamma
2016-07-04  1.936856 -0.785233 -0.973897 -0.419979  2  gamma
2016-07-05 -2.354342  0.732271  2.352417 -1.059573  5  alpha
2016-07-06  0.008768 -0.452755  0.423542 -1.794791  2  gamma

### 7-4) 특정 값을 가진 행 구하기

In [165]:
# 기본은 loc쓰면 됨
df2.loc[ (df2['F']=='alpha') | (df2['F']=='beta') ,:]

                   A         B         C         D  E      F
2016-07-01 -0.992464 -1.393403 -0.529352  0.538147  0  alpha
2016-07-02  2.377521 -0.102366  0.734260 -0.125385  0   beta
2016-07-05 -2.354342  0.732271  2.352417 -1.059573  5  alpha

In [166]:
# isin 메써드
df2.loc[df2['F'].isin(['alpha', 'beta']), :]

                   A         B         C         D  E      F
2016-07-01 -0.992464 -1.393403 -0.529352  0.538147  0  alpha
2016-07-02  2.377521 -0.102366  0.734260 -0.125385  0   beta
2016-07-05 -2.354342  0.732271  2.352417 -1.059573  5  alpha

### 7-5) 사용자 함수 적용

In [167]:
df3 = pd.DataFrame(np.random.randn(4, 3), columns=["b", "d", "e"],
                   index=["Seoul", "Incheon", "Busan", "Daegu"])
df3

                b         d         e
Seoul    0.146550  0.920345 -0.295230
Incheon  0.606324 -0.089693 -0.266048
Busan   -0.261988 -0.662709  0.565387
Daegu   -2.064732  1.976469  1.879895

In [170]:
func = lambda x: x.max() - x.min()

In [169]:
# 행방향, 아래방향 으로 적용
df3.apply(func, axis=0)

b    2.671056
d    2.639178
e    2.175125
dtype: float64

In [171]:
# 열방향, 좌우 방향으로 적용
df3.apply(func, axis=1)

Seoul      1.215575
Incheon    0.872372
Busan      1.228096
Daegu      4.041201
dtype: float64